Documents/ПР_ДоговорОтделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорОтделки</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОтделки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДоговорОтделки/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		АгентскийДоговор = ДанныеЗаполнения.Ссылка;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПР_ДоговорДолевогоУчастия") Тогда 
			Помещение = ДанныеЗаполнения.Помещение;
			Договор = НайтиДоговор(Помещение).ДоговорКонтрагента;
			АгентскийДоговор = НайтиДоговор(Помещение).Ссылка;
			Дата = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ДатаНачала),ДанныеЗаполнения.ДатаНачала,ТекущаяДата());
		Иначе
			Помещение = ДанныеЗаполнения.ОбъектыАренды[0].ОбъектАренды;
			Договор = ДанныеЗаполнения.ДоговорКонтрагента;
			Дата = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектыАренды[0].ДатаПередачи),ДанныеЗаполнения.ОбъектыАренды[0].ДатаПередачи,ТекущаяДата());
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			Дата = ТекущаяДата();
		КонецЕсли;
		ДатаНачала = Дата;  
	КонецЕсли;
КонецПроцедуры

Функция НайтиДоговор(Помещение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение";
	Запрос.УстановитьПараметр("Помещение",Помещение);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции
